export const POOL_PRESETS = [
  {
    id: "pool-90",
    name: "90分以上",
    names: [
      "余江浩", "张鸣桐", "郭子睿", "张恒源", "张诗娆", "崔桓恒", "戴欣妍", 
      "王永郭", "谢睿彤", "吴依煖", "张宇轩", "楼嘉琪", "邓屹桓", "郑思诺", 
      "杨怡萱", "祝诗晨", "王舒宇", "陶世轩", "杨杰予"
    ]
  },
  {
    id: "pool-80",
    name: "80-89.5分",
    names: [
      "庄梓睿", "漆子轩", "卢雨萱", "傅泽城", "曹智皓", "马一航", "马颐菡", 
      "崔西米", "何宇凡", "朱宏圳", "李诗涵", "李炎徽", "王正洋", "叶文博", 
      "林雨昊", "李晟睿", "魏莉曼", "王烨文", "胡夕语", "卢俊毅", "陈素欣"
    ]
  },
  {
    id: "pool-all",
    name: "全体名单",
    names: [
      "孙浩田", "陈子涵", "金鸿良", "王嘉卉", "李亦乐", "余江浩", "张鸣桐", "郭子睿",
      "张恒源", "张诗娆", "崔桓恒", "戴欣妍", "王永郭", "谢睿彤", "吴依煖", "张宇轩",
      "楼嘉琪", "邓屹桓", "郑思诺", "杨怡萱", "祝诗晨", "王舒宇", "陶世轩", "杨杰予",
      "庄梓睿", "漆子轩", "卢雨萱", "傅泽城", "曹智皓", "马一航", "马颐菡", "崔西米",
      "何宇凡", "朱宏圳", "李诗涵", "李炎徽", "王正洋", "叶文博", "林雨昊", "李晟睿",
      "魏莉曼", "王烨文", "胡夕语", "卢俊毅", "陈素欣", "冯琴", "方皓轩", "张柯",
      "何烨宸", "殷夏萱", "余哲雅", "徐颖熙", "张宇皓", "杨尚毅", "朱雨彤", "刘海媱",
      "鄢子俊", "王语渟", "琚思博", "俞佳诺", "徐思颖", "叶昭君", "王文汉", "张佳雯",
      "李宇翔", "郑思琪", "曹义晨", "金峻熙", "张峻灏", "董梓琦", "吴雅琪", "周子雅",
      "张程", "石欣怡", "汪嘉俊", "王洪礴", "冯添琦", "刘馨雨", "张思远", "杨雅婷"
    ]
  }
];

export const DEFAULT_NAMES = POOL_PRESETS[0].names;
